# brew command-line tools using Homebrew
# Usage: `brew bundle`

tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/completions'
tap 'caskroom/cask'
tap 'caskroom/versions'

# General development stuff
brew 'bash-completion'
brew 'git'
brew 'gpg2'
brew 'gpg-agent'
brew 'pinentry-mac'
#brew 'hub'
brew 'ansible'
brew 'curl'
brew 'mongo'
brew 'mongo-orchestration'
brew 'wget'
#brew 'cloc'
#brew 'mas'
brew 'node'

#brew 'docker' # Installed via Docker for Mac
#brew 'docker-machine' # Installed via Docker for Mac
brew 'vagrant-completion'
brew 'rsync'
brew 'unison'
brew 'mysql'

brew 'yarn'
brew 'kubernetes-cli'
brew 'blackfire-agent'
brew 'zsh'

# PHP packages
tap 'homebrew/php'
brew 'php'
# pecl mongodb, xdebug, imagick, v8js, apcu
brew 'composer'
brew 'coreutils' # Needed for realpath

# General casks
cask 'atom'
cask 'spotify'
#cask 'gitter'
#cask 'moom'
#cask 'phpstorm'
#cask 'sonos'
#cask 'toggldesktop'x
#cask 'whatpulse'
#cask 'whatsapp'
cask 'google-cloud-sdk'
cask 'vagrant'
cask 'virtualbox'
cask 'mysqlworkbench'
cask 'robo-3t'
cask 'karabiner'
cask 'spectacle'
cask 'gimp'
cask 'firefox'
cask 'mono-mdk' # Needed for fiddler
cask 'visual-studio-code'
cask 'iterm2'
cask 'the-unarchiver'