# brew command-line tools using Homebrew
# Usage: `brew bundle`

tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/completions'
tap 'caskroom/cask'
tap 'caskroom/versions'

# General development stuff
#brew 'bash-completion'
brew 'git'
brew 'gpg2'
brew 'gpg-agent'
#brew 'pinentry-mac'
#brew 'hub'
brew 'ansible'
brew 'curl'
brew 'mongo'
brew 'mongo-orchestration'
brew 'wget'
#brew 'cloc'
#brew 'mas'

brew 'docker'
brew 'docker-machine'
brew 'vagrant-completion'
brew 'rsync'
brew 'mysql'

brew 'yarn'
brew 'kubernetes-cli'
brew 'blackfire-agent'

# PHP packages
tap 'homebrew/php'
brew 'php71'
brew 'php71-intl'
brew 'php71-mongodb'
brew 'php71-xdebug'
brew 'php71-imagick'
brew 'php71-v8js'
brew 'composer'

# General casks
cask 'atom'
cask 'spotify'
#cask 'gitter'
#cask 'moom'
#cask 'phpstorm'
#cask 'sonos'
#cask 'toggldesktop'
#cask 'whatpulse'
#cask 'whatsapp'
cask 'google-cloud-sdk'
cask 'vagrant'
cask 'virtualbox'
cask 'mysqlworkbench'
cask 'robo-3t'
cask 'karabiner'
cask 'spectacle'
